tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeExpectedXmlFiles/S100ExpectedXmlFiles/NewCellWithUnitOfSaleTypeIsFolio.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_SHOP_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>165a4-12-456-b9-5977105</CORRID>
        <NOOFACTIONS>3</NOOFACTIONS>
        <RECDATE>20250319</RECDATE>
        <RECTIME>095938</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CREATE PRODUCT</ACTION>
            <PRODUCT>SHOP CELL</PRODUCT>
            <PRODTYPE>s101</PRODTYPE>
            <CHILDCELL>101GB007645JTHG83</CHILDCELL>
            <PRODUCTNAME>101GB007645JTHG83</PRODUCTNAME>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>GB03</AGENCY>
            <PROVIDER>1B</PROVIDER>
            <ENCSIZE>small</ENCSIZE>
            <TITLE>101GB007645JTHG83</TITLE>
          </item>
          <item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>ASSIGN PRODUCT TO UNIT OF SALE</ACTION>
            <PRODUCT>SHOP UNIT</PRODUCT>
            <PRODTYPE>s101</PRODTYPE>
            <CHILDCELL>101GB007645JTHG83</CHILDCELL>
            <PRODUCTNAME>101GB007645JTHG83</PRODUCTNAME>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
          </item>
          <item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>ASSIGN PRODUCT TO UNIT OF SALE</ACTION>
            <PRODUCT>SHOP UNIT</PRODUCT>
            <PRODTYPE>s101</PRODTYPE>
            <CHILDCELL>101GB007645JTHG83</CHILDCELL>
            <PRODUCTNAME>s100WorldFolio</PRODUCTNAME>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
          </item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_SHOP_MAT_INFO>
  </soap:Body>
</soap:Envelope>
